Revit 2024 API
PreviewControl.BeginAnimation Method
Overload List
Name | Description
BeginAnimation(DependencyProperty, AnimationTimeline)
Starts an animation for a specified animated property on this element.
 (Inherited from UIElement.)
BeginAnimation(DependencyProperty, AnimationTimeline, HandoffBehavior)
Starts a specific animation for a specified animated property on this element, with the option of specifying what happens if the property already has a running animation.
 (Inherited from UIElement.)
See Also
PreviewControl Class
PreviewControl Members
Autodesk.Revit.UI Namespace